[
  {
    "id": 1,
    "title": "Landing page para software",
    "linkName": "SmartPOS Cloud",
    "link": "/#",
    "date": "Febrero 2024 - Abril 2024",
    "items": [
      "Desarrollé la landing page ideal para “SmartPOS Cloud“, con el objetivo de vender los planes de pago para utilizar el software a través de un diseño atractivo.",
      "Implementé la integración de pagos por Paypal a través de una API",
      "Subí y alojé el sitio en un servidor de hosting y configuré el servicio de envío de emails."
    ],
    "technologies": ["React.js", "TailwindCSS", "JavaScript"]
  },
  {
    "id": 2,
    "title": "Portafolio de imágenes para fotógrafo",
    "linkName": "Cesar Martinez Edo",
    "link": "https://cesaresedo.com/",
    "date": "Febrero 2024 - Abril 2024",
    "items": [
      "Creé el sitio web para alojar y presentar el contenido multimedia de un fotógrafo, permitiendo visualizar imágenes y videos.",
      "Implementé un panel de administrador con inicio de sesión privado, en el que se pueden subir las imágenes, videos, categorías, entre otros datos."
    ],
    "technologies": ["React.js", "TailwindCSS", "JavaScript"]
  },
  {
    "id": 3,
    "title": "E-commerce de productos agrícolas",
    "linkName": "XPLAZA",
    "link": "/#",
    "date": "Diciembre 2023 - Enero 2024",
    "items": [
      "Desarrollé la plataforma e-commerce del comercio agrícola “XPLAZA”, permitiendo a los usuarios comprar y vender productos.",
      "Integré una barra de búsqueda, filtros por categorías, inicio de sesión, página de producto, galería de imágenes, paginación, entre otros."
    ],
    "technologies": [
      "Next.js",
      "React.js",
      "TailwindCSS",
      "TypeScript",
      "JavaScript"
    ]
  },
  {
    "id": 4,
    "title": "Migración de tecnologías de página web",
    "linkName": "Chrysler 65",
    "link": "https://www.bumoai.com/",
    "date": "Diciembre 2023",
    "items": [
      "Transformé una página web hecha con Next.js a tecnologías HTML, CSS, JS, manteniendo el mismo diseño, reduciendo el código, y mejorando las animaciones y el diseño responsive."
    ],
    "technologies": ["HTML", "JavaScript", "CSS"]
  },
  {
    "id": 5,
    "title": "Landing page para software de IA",
    "linkName": "BumoAI",
    "link": "https://www.bumoai.com/",
    "date": "Diciembre 2023",
    "items": [
      "Llevé a cabo la creación de la landing page del programa “BumoAI”, destacando los beneficios e incentivando a los usuarios a contratar un plan de pago."
    ],
    "technologies": ["Next.js", "React.js", "TailwindCSS", "JavaScript"]
  },
  {
    "id": 6,
    "title": "Landing page para aplicación de eventos",
    "linkName": "Festivus",
    "link": "https://festivusapp.com/",
    "date": "Diciembre 2023",
    "items": [
      "Llevé a cabo la creación de la landing page para la aplicación de eventos “Festivus”, destacando los beneficios e incentivando a que sea descargada por los usuarios.",
      "Aseguré la correcta visualización de la página en el 100% de dispositivos, incluidos aquellos con navegadores antiguos y con poca compatibilidad con tecnologías actuales."
    ],
    "technologies": ["HTML", "JavaScript", "CSS"]
  },
  {
    "id": 7,
    "title": "Desarrollador Front-end",
    "linkName": "Wapidelo",
    "link": "https://www.wapidelo.com/",
    "date": "Diciembre 2022 - Febrero 2023",
    "items": [
      "Incrementé la velocidad de carga de datos en un 40% a través de la implementación de tecnologías modernas como GraphQL, provocando una mayor fluidez y mejor experiencia de usuario.",
      "Implementé y creé desde cero nuevas funcionalidades, expandiendo las opciones disponibles para el usuario.",
      "Hice pruebas de cada nueva implementación asegurando el correcto desempeño con el resto de componentes."
    ],
    "technologies": [
      "Next.js",
      "React.js",
      "TailwindCSS",
      "TypeScript",
      "JavaScript",
      "Apollo Client",
      "GraphQL"
    ]
  }
]
